# MullionTypeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionTypeSet Constructor
MullionTypeSet Class See Also
---
Initializes a new instance of the MullionTypeSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MullionTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MullionTypeSet()
```

# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace